erp3l/src/Documents/КвалификацияПоставщика/КвалификацияПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КвалификацияПоставщика</name>
  <basedOn>Document.ОповещениеАккредитованныхПоставщиковОТоргах</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.УчастникиКвалификации</registerRecords>
  <registerRecords>InformationRegister.УчастникиКвалифицированныеПоЛоту</registerRecords>
  <attributes>
    <name>АнкетаПоставщика</name>
    <type>
      <types>CatalogRef.АнкетыПоставщиков</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаСогласование</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументАккредитации</name>
    <type>
      <types>DocumentRef.АккредитацияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказОНазначенииКомиссии</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииЗакупочнойКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПоДокументу</name>
    <type>
      <types>EnumRef.ВидыРешенийПоДокументуКвалификации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛот</name>
    <type>
      <types>CatalogRef.Лоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаПодачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребованияЛота</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМножества</name>
      <type>
        <types>DefinedType.ТипЗначенияКритерияОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненИзАккредитации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийУчастника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеПоложительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКомиссии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеАккредитации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьКомиссияПоКвалификации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиЧленовКомиссии</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/КвалификацияПоставщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.УчастникиКвалифицированныеПоЛоту.Записывать = Истина;
	Движения.УчастникиКвалификации.Записывать = Истина;
	Движение = Движения.УчастникиКвалификации.Добавить();
	Движение.ЗакупочнаяПроцедура = ЗакупочнаяПроцедура;
	Движение.Участник = АнкетаПоставщика;
	РодителиНоменклатуры = Новый Соответствие;
	флКвалифицирован = (РешениеПоДокументу 
		= Перечисления.ВидыРешенийПоДокументуКвалификации.ПоложительноеРешение);
	Если флКвалифицирован Тогда
	Если НЕ ТИПЗНч(АнкетаПоставщика)=Тип("СправочникСсылка.Контрагенты") И НЕ ЗначениеЗаполнено(АнкетаПоставщика.Контрагент) Тогда
			ПоставщикОбъект = АнкетаПоставщика.ПолучитьОбъект();
			ПоставщикОбъект.Контрагент =
				АккредитацияПоставщиковУХ.ПолучитьКонтрагентаПоставщика(
					АнкетаПоставщика);
			ПоставщикОбъект.Записать();
		КонецЕсли;
		// поставщик квалифицирован по лоту
		Движение = Движения.УчастникиКвалифицированныеПоЛоту.Добавить();
		Движение.ЗакупочнаяПроцедура = ЗакупочнаяПроцедура;
		Движение.УчастникАккредитации = АнкетаПоставщика;
		Если  ТИПЗНч(АнкетаПоставщика)=Тип("СправочникСсылка.Контрагенты") Тогда
		Движение.Контрагент = АнкетаПоставщика;	
		Иначе	
		Движение.Контрагент = АнкетаПоставщика.Контрагент;
		КонецЕсли;
		Движение.ДатаУтверждения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	УстановитьОрганизациюПоЗакупке();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ДругойДокумент = 
		Документы.КвалификацияПоставщика.ПолучитьАналогичныйДокумент(
			ЭтотОбъект);
	Если ЗначениеЗаполнено(ДругойДокумент) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр(
			"ru='Уже есть квалификация поставщика ""%1"" для анкеты"
				+ " поставщика ""%2"" для закупочной процедуры ""%3""!'"),
			ДругойДокумент,
			АнкетаПоставщика,
			ЗакупочнаяПроцедура);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ТипЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипЗаполнения = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Иначе
			Если НЕ ЦентрализованныеЗакупкиУХ.ОбъектУтвержден(ДанныеЗаполнения.Ссылка) Тогда
				ВызватьИсключение НСтр("ru='Ввод на основании можно делать только"
					+ " на основании утвержденной закупочной процедуры!'");
			КонецЕсли;
			Если НЕ ДанныеЗаполнения.ТребуетсяКвалификационныйОтбор Тогда
				ВызватьИсключение НСтр("ru='Ввод на основании можно делать только"
					+ " на основании закупочной процедуры с квалификационным отбором!'");
			КонецЕсли;
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗаполнения) Тогда
				Если НЕ ДанныеЗаполнения.Проведен Тогда
					ВызватьИсключение НСтр("ru='Ввод на основании можно делать только "
						+ "на основании проведенного документа!'");
				КонецЕсли;
			КонецЕсли;
			Если ТипЗаполнения = Тип("СправочникСсылка.ЗакупочныеПроцедуры") Тогда
				ЗакупочнаяПроцедура = ДанныеЗаполнения;
			ИначеЕсли ТипЗаполнения = 
					Тип("ДокументСсылка.ОповещениеАккредитованныхПоставщиковОТоргах") Тогда
				ЗакупочнаяПроцедура = ДанныеЗаполнения.ЗакупочнаяПроцедура;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	УстановитьОрганизациюПоЗакупке();
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(РешениеПоДокументу) Тогда
		РешениеПоДокументу = Перечисления.ВидыРешенийПоДокументуКвалификации.РешениеНеПринято;
	КонецЕсли;
	ЭтоВнешнийПользователь = ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя();
	Если ЭтоВнешнийПользователь Тогда
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		АнкетаПоставщика = ТекущийПользователь.ОбъектАвторизации;
	Иначе
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗакупочнаяПроцедура) Тогда
		Если НЕ ЗакупочнаяПроцедура.ТребуетсяКвалификационныйОтбор Тогда
			ВызватьИсключение НСтр("ru='Ввод на основании можно делать только"
				+ " на основании закупки с квалификационным отбором!'");
		КонецЕсли;
		Если ЗначениеЗаполнено(АнкетаПоставщика) Тогда
			ДанныеАккредитации = АккредитацияПоставщиковУХ.ПолучитьДанныеАккредитацииПоставщика(Организация, АнкетаПоставщика, Дата);
			Если ДанныеАккредитации <> Неопределено
					И ДанныеАккредитации.Состояние = Перечисления.СостоянияАккредитацииПоставщиков.Аккредитован Тогда
				ДокументАккредитации = ДанныеАккредитации.Регистратор;
			КонецЕсли;
			ТребованияЛота.Загрузить(
				АккредитацияПоставщиковУХ.ПолучитьТребованияЗакупкиДляПоставщика(
					ЗакупочнаяПроцедура,
					АнкетаПоставщика,
					ТребованияЛота.Выгрузить()));
		Иначе
			мНоменклатуры =
			ЦентрализованныеЗакупкиУХ.ПолучитьМассивНоменклатурыИГруппЗакупки(
				ЗакупочнаяПроцедура);
			ТребованияПоНоменклатуре = 
				АккредитацияПоставщиковУХ.ПолучитьВсеТребованияПоНоменклатуре(
					Дата,
					Организация,
					мНоменклатуры);
			ТребованияЛота.Загрузить(
				АккредитацияПоставщиковУХ.ОбъединитьТребованияКПоставщикам(
					ЗакупочнаяПроцедура.ТребованияКПоставщикам.Выгрузить(),
					ТребованияПоНоменклатуре));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьОрганизациюПоЗакупке()
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Если ЗначениеЗаполнено(ЗакупочнаяПроцедура) Тогда
			Организация = ЗакупочнаяПроцедура.ОрганизаторЗакупки;
		Иначе
			Организация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецЕсли
